---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.RoutingPreferenceParam
source: html/5783b8d1-be2a-81f2-34ab-cad8c3a9f4dd.htm
---
# Autodesk.Revit.DB.ParameterTypeId.RoutingPreferenceParam Property

"Routing Preference"

## Syntax (C#)
```csharp
public static ForgeTypeId RoutingPreferenceParam { get; }
```